{"data":{"allSitePage":{"edges":[{"node":{"context":{"name":"Sports centre Vllazerimi","category":["competitions","architecture"],"location":"Kichevo, North Macedonia","year":2019,"status":"national competition-3rd award","surface":38166,"titleImage":"vlazerimi-1.jpg","images":["vlazerimi-2.jpg","vlazerimi-3.jpg","vlazerimi-4.jpg","vlazerimi-5.jpg","vlazerimi-6.jpg","vlazerimi-7.jpg","vlazerimi-8.jpg","vlazerimi-9.jpg","vlazerimi-10.jpg","vlazerimi-11.jpg","vlazerimi-12.jpg","vlazerimi-13.jpg","vlazerimi-14.jpg","vlazerimi-15.jpg","vlazerimi-16.jpg","vlazerimi-17.jpg","vlazerimi-1.jpg","vlazerimi-18.jpg","vlazerimi-19.jpg","vlazerimi-20.jpg","vlazerimi-21.jpg","vlazerimi-22.jpg"],"description":"Sports Center Vllazërimi is located nearby the river Zajacka in Kichevo city.\nThe concept of the complex is a combination of bold volumes: the longest rectangle has the football court and 7000 seats-this volume is light and at the ground level it represents a shopping promenade, while the smallest rectangle holds the restaurant and other commercial facilities and it is also the billboard of the complex. The cube volume has an indoor pool, fitness center, bowling, dance rooms, and its roof hosts an open tennis court with an athlete route whereas the tennis court can be used as an ice-skating court during the winter. While the bridge volume is faced towards the river and it offers a connection with the volumes as a horizontal promenade. The connection of the volumes forms an inner plaza, half of which is covered and it ends up with amphitheater stairs towards the river."}}},{"node":{"context":{"name":"Ascension tower","category":["competitions","architecture"],"location":"Zagreb, Croatia","year":2019,"status":"international competition-among 10 finalists","surface":160,"titleImage":"ascension-tower-14.jpg","images":["ascension-tower-1.jpg","ascension-tower-2.jpg","ascension-tower-3.jpg","ascension-tower-4.jpg","ascension-tower-5.jpg","ascension-tower-6.jpg","ascension-tower-7.jpg","ascension-tower-8.jpg","ascension-tower-9.jpg","ascension-tower-10.jpg","ascension-tower-11.jpg","ascension-tower-12.jpg","ascension-tower-13.jpg","ascension-tower-15.jpg"],"description":"By the river bank stands the new Zagreb's landmark. This is a transparent one!\nIt stands by its main core which consists of two elevators and fire stairs inside, which leads to the highest point, the platform from which you can observe the city in a 360-degree panoramic view.\nThrough the main stairs, the whole city can be observed from all the corners, like a vertical promenade. You can take a break and enjoy the view in two points that are extensions of the stairs which are forming some sort of amphitheaters. These two viewpoints can also be reached directly through the elevators.\nThe vertical promenade is wrapped transparently by a steel structure that intertwines vertically and horizontally. This white structure forms the body of the tower and connects the inside and the outside. It makes it a pure landmark by the day, and a lighting landmark by the night. "}}},{"node":{"context":{"name":"Kids factory","category":["competitions","architecture"],"location":"Laveno Mombello, Italy","year":2019,"status":"international competition-finalist mention","surface":27000,"titleImage":"kids-factory-6.jpg","images":["kids-factory-1.jpg","kids-factory-2.jpg","kids-factory-3.jpg","kids-factory-4.jpg","kids-factory-5.jpg","kids-factory-7.jpg","kids-factory-8.jpg","kids-factory-9.jpg"],"description":"NEVER GROW UP!-was the motto of this project, which takes place at a former pottery factory near the banks of Lake Maggiore.\nKids factory is a whole new planet waiting to be discovered. The scale of the location enables a handful of mini-worlds to take place within the walls of the factory. The new 'Kids Boulevard' runs through the location, and serves as a fast route to all the different programs and thematic sectors, being used as a pedestrian walkway, but also offering a mini-train ride through the location.\nThe playgrounds - are consisted of 7 thematic sectors each representing a new 'world'.\nNew villages, landscapes, and forests offer a touch with nature but also the fantasy world. Much is left to the children's fantasy and these are places that do not appeal only for a certain age. Children of all ages can find their own entertainment here.\nThe educational sector is spread throughout an open plan area, forming different unconventional classroom spaces. The research center and the laboratories are situated on the first floor and the accommodation spaces are on the second floor. The old buildings form the 'Square of Pottery', accommodating offices, souvenir shops, and the new museum of pottery.\n'Square of events' becomes new collective space for Laveno Mombello connecting the location with its surrounding, but also becoming a landmark. The public spaces flow to the roof of the factory which becomes a public space, offering the people a place where they can spend time enjoying the view of the lake."}}},{"node":{"context":{"name":"Rwanda chapel-The cathedral of light","category":["competitions","architecture"],"location":"Rukomo, Africa","year":2019,"status":"international competition","surface":1215,"titleImage":"rwanda-chapel-0.jpg","images":["rwanda-chapel-1.jpg","rwanda-chapel-2.jpg","rwanda-chapel-3.jpg","rwanda-chapel-4.jpg","rwanda-chapel-5.jpg","rwanda-chapel-6.jpg","rwanda-chapel-7.jpg","rwanda-chapel-8.jpg","rwanda-chapel-9.jpg","rwanda-chapel-10.jpg"],"description":"At the top of the mountain, there is a place to wake up the inner peace. A chapel for the people to remind us that we are all the same. Its narrow wall can be seen from everywhere, so as the calling of the bell. When you reach the chapel there is more than just a wall… it's an art of seeing!\nThe parvis of the chapel is the chapel's backyard, it is the reaching and gathering point, the first impression of the light and the surrounding. This place can be used for preaching in cases of a larger audience. It is defined by two walls that constrict at the preaching place to limit the view horizon, while the independent wall has openings to play with the shadow, the light, and nature.\nSmall arcade openings lead you to the atrium of the chapel. Here, a rain bed welcomes the visitors allowing them to cherish the rainwater, its calming sound, and its purity. The nave is reached through doors made out of transparent wooden interlace. They can be closed when needed, but while open they offer you a ceremonial entry in the chapel… the place to pray, celebrate, cry, and to hope. A circular wall - the symbol of the self, the relationship between man and the whole nature, defines the presbytery, while more is left to the light. Every time the daylight makes the space and the atmosphere different. Light of faith comes from the back area of the sacristy.\nLocal materials are used everywhere, bringing the atmosphere of the earth in each brick and in each wall layer. They offer an archaic, emotional, and intimate feeling of the place. The main walls are from rammed earth, while the other walls play with light and shadow with the absence of a brick. Pragmatic forms convey the chapel- square - the main geometry, with inner elements placed with a golden section. Simple, but with the power to embody the feeling of nostalgia, serenity, death, solitude, silence, beauty, myth, nature, and religion."}}},{"node":{"context":{"name":"Industry in a city – dynamic facade","category":["competitions","architecture"],"location":"Skopje, North Macedonia","year":2018,"status":null,"surface":null,"titleImage":"dynamic-facade-0.jpg","images":["dynamic-facade-1.jpg","dynamic-facade-2.jpg","dynamic-facade-3.jpg","dynamic-facade-4.jpg","dynamic-facade-5.jpg","dynamic-facade-6.jpg","dynamic-facade-7.jpg"],"description":"Usje is an old, well-known factory for cement production in the city of Skopje. Its surrounding has experienced a drastic growth and transformation into a dense urban residential area, making the factory undesirable for the residents.\nThe new facade proposal aims to hide the current surface of the silos with the help of a metal dynamic facade. The pattern that covers the silos comes from the mountains behind the factory that the residents can't enjoy because of this structure. The wind makes the metal forms trembling, offering a calming effect, and becoming a landmark of the place."}}},{"node":{"context":{"name":"Observatory houses","category":["competitions","architecture"],"location":"Roccascglena, Italy","year":2017,"status":null,"surface":null,"titleImage":"observatory-houses-0.jpg","images":["observatory-houses-1.jpg","observatory-houses-2.jpg","observatory-houses-3.jpg","observatory-houses-4.jpg","observatory-houses-5.jpg","observatory-houses-6.jpg","observatory-houses-7.jpg","observatory-houses-8.jpg","observatory-houses-9.jpg","observatory-houses-10.jpg"],"description":"Architecture is all about geometry and light. The light is about perceiving the form and the darkness is because the absence of light. Having that in mind, the new intervention itself is a clear strong gesture that complements and amplifies with the impressive landscape. The new white stripe is clearly set apart from the fortress, so it is evident that they are built at different periods of time. The stripe that meanders and adapts to the ground becomes dramatic as the terrain itself, which imitates the way of building of the old fortress where each wall follows the natural shape of the rock, forming different platforms with a beautiful view. The gesture starts at the edge of the old town and ends with a tower that interprets the old tower which collapsed in 1940. An inner street connects the programs from the entrance of the building and at some points it opens to the outside and leads to the external extensions such as: observatory swimming pool, observatory amphitheater and various platforms for observing the landscape or camping. Curiosity for exploring and the feeling of mystery are awaken with the play of light and shadows. The promenade culminates in a tower which contains a water collector with an observation telescope at the top and is connected to the fortress with a folding bridge. The houses are places of solitude and daydreaming, representing observatories on their own way. They are archaic shelters with carefully selected openings so that visitors can peek into the landscape or observe the starry sky. Their program is minimal in order to focus on their main goal, the chance to watch the sky in an extremely intimate atmosphere."}}}]}}}