[
  {
    "id": "project-1",
    "name": "Sports centre Vllazerimi",
    "category": ["competitions", "architecture"],
    "location": "Kichevo, North Macedonia",
    "year": 2019,
    "status": "national competition-3rd award",
    "surface": 38166,
    "titleImage": "vlazerimi-0.jpg",
    "images": [
      "vlazerimi-1.jpg",
      "vlazerimi-2.jpg",
      "vlazerimi-3.jpg",
      "vlazerimi-4.jpg",
      "vlazerimi-5.jpg",
      "vlazerimi-6.jpg",
      "vlazerimi-7.jpg",
      "vlazerimi-8.jpg",
      "vlazerimi-9.jpg",
      "vlazerimi-10.jpg",
      "vlazerimi-11.jpg",
      "vlazerimi-12.jpg",
      "vlazerimi-13.jpg",
      "vlazerimi-14.jpg",
      "vlazerimi-15.jpg",
      "vlazerimi-16.jpg",
      "vlazerimi-17.jpg",
      "vlazerimi-18.jpg",
      "vlazerimi-19.jpg",
      "vlazerimi-20.jpg",
      "vlazerimi-21.jpg",
      "vlazerimi-22.jpg"
    ],
    "description": "Sports Center Vllazërimi is located nearby the river Zajacka in Kichevo.\nThe sports complex is a composition of rectangular blocks surrounding an internal plaza. An air bridge and a portico interconnect the separate blocks. A light facade encloses the 7000 - seat football field forming a shopping promenade at the ground level.\n A mixed program block consists of an indoor pool, fitness center, bowling alley and dance rooms positioned on each floor. Its roof hosts an open tennis court and a running track.\nThe football field and the mixed program block are connected with an air bridge faced towards the river, offering fantastic views on the forest. The entrances of the complex are positioned under a floating block which represents a roof of a small part of the inner plaza. A cascade landscape makes a connection with the river."
  },
  {
    "id": "project-2",
    "name": "Ascension tower",
    "category": ["competitions", "architecture"],
    "location": "Zagreb, Croatia",
    "year": 2019,
    "status": "international competition-among 10 finalists",
    "surface": 160,
    "titleImage": "ascension-tower-0.jpg",
    "images": [
      "ascension-tower-1.jpg",
      "ascension-tower-2.jpg",
      "ascension-tower-3.jpg",
      "ascension-tower-4.jpg",
      "ascension-tower-5.jpg",
      "ascension-tower-6.jpg",
      "ascension-tower-7.jpg",
      "ascension-tower-8.jpg",
      "ascension-tower-9.jpg",
      "ascension-tower-10.jpg",
      "ascension-tower-11.jpg",
      "ascension-tower-12.jpg",
      "ascension-tower-13.jpg",
      "ascension-tower-14.jpg",
      "ascension-tower-15.jpg"
    ],
    "description": "By the river bank stands the new Zagreb's landmark. This is a transparent one! \nIt holds on to its main core which consists of two elevators and stairs. The highest point, the platform, is where one can observe the city in a 360-degree panoramic view.\nClimbing the outside stairs, one can observe the city from all corners, like walking through a vertical promenade. One can take a break and enjoy the view in two stop points that are extensions of the stairs - forming amphitheatrical seating. These two viewpoints can also be reached via the elevators. A steel structure wraps the entire promenade and its core. It is a semi-transparent skin that intertwines in a vertical and horizontal direction. This white structure forms the body of the tower and connects the inside and the outside.\nThe tower becomes a pure landmark by day and a lighting landmark by night."
  },
  {
    "id": "project-3",
    "name": "Kids factory",
    "category": ["competitions", "architecture"],
    "location": "Laveno Mombello, Italy",
    "year": 2019,
    "status": "international competition-finalist mention",
    "surface": 27000,
    "titleImage": "kids-factory-0.jpg",
    "images": [
      "kids-factory-1.jpg",
      "kids-factory-2.jpg",
      "kids-factory-3.jpg",
      "kids-factory-4.jpg",
      "kids-factory-5.jpg",
      "kids-factory-6.jpg",
      "kids-factory-7.jpg",
      "kids-factory-8.jpg",
      "kids-factory-9.jpg"
    ],
    "description": "NEVER GROW UP!- is the motto of this project, which takes place in a former pottery factory near the banks of Lake Maggiore. Kids' factory is a whole new planet waiting to be discovered. The scale of the location enables a handful of mini-worlds to take place within the walls of the factory.\nThe new “Kids Boulevard“ serves as a fast route to all the different programs and thematic sectors. The boulevard is a pedestrian walkway but also offers a mini-train ride through the location.\nThe playgrounds consist of 7 thematic sectors each representing a new “world“.\nNew villages, landscapes, and forests offer a touch with nature but also the fantasy world. Much is left to the children's imagination and these are places that do not appeal only for a certain age. Children of all ages can find their own entertainment here.\nThe educational sector occupies an open plan area, forming different unconventional classroom spaces. The research center and the laboratories are situated on the first floor and the accommodation spaces are on the second floor. The old buildings enclose the “Square of Pottery“ which accommodates offices, souvenir shops, and the new museum of pottery.\n“Square of events“ becomes new collective space for Laveno Mombello. The square connects the location with its surroundings while becoming a landmark. The public spaces flow to the roof of the factory which becomes a public space. The new roof terrace offers people a place where they can spend time enjoying the view of the lake."
  },
  {
    "id": "project-4",
    "name": "Rwanda chapel-The cathedral of light",
    "category": ["competitions", "architecture"],
    "location": "Rukomo, Rwanda",
    "year": 2019,
    "status": "international competition",
    "surface": 1215,
    "titleImage": "rwanda-chapel-0.jpg",
    "images": [
      "rwanda-chapel-1.jpg",
      "rwanda-chapel-2.jpg",
      "rwanda-chapel-3.jpg",
      "rwanda-chapel-4.jpg",
      "rwanda-chapel-5.jpg",
      "rwanda-chapel-6.jpg",
      "rwanda-chapel-7.jpg",
      "rwanda-chapel-8.jpg",
      "rwanda-chapel-9.jpg",
      "rwanda-chapel-10.jpg"
    ],
    "description": "At the top of the mountain, there is a place to wake up the inner peace. A people's chapel to remind us that we are all the same. Its narrow wall is visible from everywhere, so is the calling of the bell. When you reach the chapel there is more than a wall… it's a view of art!\nThe parvis of the chapel is the chapel's backyard, it is the reaching and gathering point, the first impression of the light and the surrounding. This place can be used by a larger audience. It is defined by two walls that constrict at the preaching place to limit the view horizon. The independent wall encloses the plaza and to play with the shadow, the light, the nature.\nSmall arcade openings lead you to the atrium of the chapel. Here, a rain bed welcomes the visitors allowing them to cherish the rainwater, its calming sound, and its purity. The nave is reached through doors made out of transparent wooden interlace. They can be closed when needed, but while open they offer you a ceremonial entry into the chapel… the place to pray, celebrate, cry, and to hope. A circular wall - the symbol of the self, the relationship between man and the whole nature, defines the presbytery, while more is left to the light. Every time the daylight makes the space and the atmosphere different. \nLocal materials are used everywhere, bringing the atmosphere of the earth in each brick and in each wall layer. They offer an archaic, emotional, and intimate feeling of the place. The main walls are from rammed earth, while the other walls play with light and shadow with the absence of a brick. Simple, but with the power to embody the feeling of nostalgia, serenity, death, solitude, silence, beauty, myth, nature, and religion."
  },
  {
    "id": "project-5",
    "name": "Apartment D",
    "category": ["interior design"],
    "location": "Skopje, North Macedonia",
    "year": 2020,
    "status": "realized",
    "surface": 60,
    "titleImage": "apartment-d-0.jpg",
    "images": [
      "apartment-d-1.jpg",
      "apartment-d-2.jpg",
      "apartment-d-3.jpg",
      "apartment-d-4.jpg",
      "apartment-d-5.jpg",
      "apartment-d-6.jpg",
      "apartment-d-7.jpg",
      "apartment-d-8.jpg",
      "apartment-d-9.jpg",
      "apartment-d-10.jpg",
      "apartment-d-11.jpg"
    ],
    "description": ""
  },
  {
    "id": "project-6",
    "name": "Seduction pavillion",
    "category": ["competitions"],
    "location": "Bologna, Italy",
    "year": 2018,
    "status": "international competition",
    "titleImage": "seduction-pavillion-0.jpg",
    "images": [
      "seduction-pavillion-1.jpg",
      "seduction-pavillion-2.jpg",
      "seduction-pavillion-3.jpg",
      "seduction-pavillion-4.jpg",
      "seduction-pavillion-5.jpg",
      "seduction-pavillion-6.jpg",
      "seduction-pavillion-7.jpg",
      "seduction-pavillion-8.jpg"
    ],
    "description": "The exhibition installation takes place at the entrance of the Foundation Fashion Research, Italy. It aims to pay a tribute to the female beauties that have almost been part of the Hollywood and Italian star system but never achieved fame. The installation celebrates the virtues of elegance, seduction, and refinement of these stars.\nCurvy lines of the wall seduce the visitors to enter the pavilion. A collage of the stars' silhouettes, engraved on the surrounding wall, suggests on what the exhibition is about.\nInside the translucent walls is the photography exhibition.\nA “glory room“ is placed near the exit of the pavilion. It is a small room of mirrors and diamonds creating an infinity effect, where the visitor can take a picture and enjoy a moment of glamour."
  },
  {
    "id": "project-7",
    "name": "Apartment GP",
    "category": ["interior design"],
    "location": "Skopje, North Macedonia",
    "year": 2020,
    "status": "realized",
    "surface": 78,
    "titleImage": "apartment-gp-0.jpg",
    "images": [
      "apartment-gp-0a.jpg",
      "apartment-gp-2.jpg",
      "apartment-gp-3.jpg",
      "apartment-gp-4.jpg",
      "apartment-gp-5.jpg",
      "apartment-gp-6.jpg",
      "apartment-gp-7.jpg",
      "apartment-gp-8.jpg",
      "apartment-gp-9.jpg",
      "apartment-gp-10.jpg",
      "apartment-gp-11.jpg",
      "apartment-gp-12.jpg",
      "apartment-gp-13.jpg",
      "apartment-gp-14.jpg",
      "apartment-gp-15.jpg",
      "apartment-gp-16.jpg",
      "apartment-gp-17.jpg",
      "apartment-gp-18a.jpg",
      "apartment-gp-19.jpg",
      "apartment-gp-20.jpg",
      "apartment-gp-22.jpg",
      "apartment-gp-23.jpg",
      "apartment-gp-24.jpg"
    ],
    "description": ""
  },
  {
    "id": "project-8",
    "name": "Back to nature",
    "category": ["competitions", "research"],
    "location": "/",
    "year": 2019,
    "status": "international competition-honorable mention",
    "titleImage": "back-to-nature-0.jpg",
    "images": ["back-to-nature-1.jpg", "back-to-nature-2.jpg"],
    "description": "The current way of life has become unhealthy for all living beings and destructive for the planet. People became antisocial and have less connection with nature.\nIt is time for a new era, new movement, a sustainable future where some rules are a MUST. People should learn how to respect nature and resources by practicing the process of their production. It is time for everybody to produce their own energy, recycle the water and the waste they create, produce, and grow the food they eat.\nSuch rules for a sustainable future, demand a new way of dwelling. A different housing concept that will strongly affect the social aspect of humans and their city of tomorrow. Reinforcing the idea of the Immeuble villas which had their own gardens, the new “building” will enclose an “empty” green space, filled with rooms (private spaces). The building can be a home for 1, 2 … 10 families, and will replace the classic building system in the classic urban block.\nPeople will work from home, so the working space will be a must and the “after work” time will be mostly spent outside in the public spaces of the city. With that, the living room and the working space turn into a green oasis where people can spend most of the time in a direct connection with the nature. Every household grows its home greenery including food crops. The new kitchen includes new build-in modules for selected recycling. The process of product processing will now go through a full cycle.\nThe consequences of such living will also be visible in the city's functioning and programs. The “Machines for living” will turn into “Green oasis for living and working” and the “collective living” will turn into a “semi-public space”."
  },
  {
    "id": "project-9",
    "name": "Education everywhere",
    "category": ["competitions", "research"],
    "location": "/",
    "year": 2018,
    "status": "international competition-1st place",
    "titleImage": "education-everywhere-0.jpg",
    "images": ["education-everywhere-1.jpg", "education-everywhere-2.jpg", "education-everywhere-3.jpg"],
    "description": "”No thief, however skillful, can rob one of knowledge, and that is why knowledge is the best and safest treasure to acquire.” – L. Frank Baum\nPeople affected by conflict and other humanitarian crises say education is one of their top priorities. Education provides physical and psychosocial protection that can save and sustain lives. Education should be available to everyone. In a crisis state of emergency, everything should be assembled, disassembled, and transformed in a fast way.\nEmergency means feasibility. A practical design should be simple and focused.\n“Education everywhere” is a design for mobile school consisted of six trailers that can transform into a more complex facility. Four of the trailers are designed as fold-construction tents which can be opened up to become two classrooms, a library, and a computer room. The classrooms can also join in one room, as well as a dormitory space during the night. The tents are easily assembled using the force of the vehicles. The other two trailers consist of toilets, a small kitchen, and a back-office room which is also used as storage when the school is transported. This kind of design offers a very flexible spatial composition, used in a variety of situations."
  },
  {
    "id": "project-10",
    "name": "The touch",
    "category": ["competitions", "research"],
    "location": "Algarve coast, Portugal",
    "year": 2018,
    "status": "international competition-2nd place",
    "titleImage": "the-touch-0.jpg",
    "images": ["the-touch-1.jpg", "the-touch-1a.jpg", "the-touch-2.jpg"],
    "description": "The Algarve Coast in Portugal, a perfect natural observatory and border between the two main surfaces of our planet, the sea, and the earth. The two vital elements that offer us life, but suffer from our detrimental behavior.\nOn the edge of this landscape observatory, stands a sculpture, a point of awareness, that connects these two surfaces. It is the ”Sea Museum”, a lighthouse that can be seen from any point of the coast, but still makes you wonder about its hidden ability to lighten up your mind. This museum offers visitors a communication and experience with the Sea World, with a mission to make changes for a better place on planet Earth.\nThe hidden spaces underneath the earth represent the five Oceans. Each representation shows the unique natural characteristics, and their dark polluted side caused by the Human factor. Each ocean is represented by a space with different ceiling height and temperature fluctuations. The flora and fauna of the oceans are projected to the walls showing the different organisms that live in every one of the depth zones. The oceans are interconnected with a path that leads visitors through the permanent exhibition. The ceiling of this representation of the oceans is a platform that is used for the temporary exhibition – the pollution problems. This way the visitors’ perfect trip to the undersea fades under the plastic trash floating above their heads. How to better show the problem than to try to represent the reality? This is a temporary exhibition we all hope will not last for long!"
  },
  {
    "id": "project-11",
    "name": "State of balance",
    "category": ["competitions", "research"],
    "location": "Kichevo, North Macedonia",
    "year": 2017,
    "status": "international competition-honorable mention",
    "titleImage": "state-of-balance-0.jpg",
    "images": ["state-of-balance-1.jpg", "state-of-balance-2.jpg"],
    "description": "Anchoring our identity is a need. To remember who we are, we need to get home. Creating our home is one of the most meaningful activities we are ever engaged in.\nIn every dream of a house, there is a possibility for a huge cosmic house that allows us to daydream and to populate the Universe. The walls of the house can spread or shrink at our will, but, the home is conceived as a concentrated being. It calls for a sense of centrality.\nComing from a community where all the generations in the family live under the same roof, we envisioned the home as a balanced shape. Every activity is reflecting on its stability. It is easily thrown out of balance but always returns to its primary state. The focus point of the home is in the space where the family eats together and prepares food. Three generations of people gather here. Climbing the stairs we go to the higher points of the home where individual spaces appear, shaped by the needs and wishes of the people who inhabit them. They are the places of solitude and silence, used mainly for sleeping. These spaces are distributed around a vertical axis. As time passes by, the old generations are replaced by the new and they take their place in the home hierarchy.\nThe human being is a spiral, a defocused being. It is no longer clear whether it runs towards the center or is running out.\nThe key to harmony is synergy and mutual support. One can go out and explore the world but is always dependent on the stability the home offers. When difficult times occur and the home is shaken out of balance, the focal point of the “home“ is the place where the family can gather and endure the turmoil."
  },
  {
    "id": "project-12",
    "name": "Industry in a city – dynamic facade",
    "category": ["competitions", "architecture"],
    "location": "Skopje, North Macedonia",
    "year": 2018,
    "titleImage": "dynamic-facade-0.jpg",
    "images": [
      "dynamic-facade-1.jpg",
      "dynamic-facade-2.jpg",
      "dynamic-facade-3.jpg",
      "dynamic-facade-4.jpg",
      "dynamic-facade-5.jpg",
      "dynamic-facade-6.jpg",
      "dynamic-facade-7.jpg"
    ],
    "description": "Usje is an old, well-known factory for cement production in the city of Skopje. Its surrounding has experienced a drastic growth and transformation into a dense urban residential area making the factory undesirable for the locals.\nThe new facade proposal aims to hide the current surface of the silos with the help of a dynamic metal facade. The pattern that covers the silos is inspired by the mountains hidden behind the factory.\nThe wind makes the metal forms tremble, offering a calming effect, and becoming a landmark of the place."
  },
  {
    "id": "project-13",
    "name": "Observatory houses",
    "category": ["competitions", "architecture"],
    "location": "Roccascglena, Italy",
    "year": 2017,
    "titleImage": "observatory-houses-0.jpg",
    "images": [
      "observatory-houses-1.jpg",
      "observatory-houses-2.jpg",
      "observatory-houses-3.jpg",
      "observatory-houses-4.jpg",
      "observatory-houses-5.jpg",
      "observatory-houses-6.jpg",
      "observatory-houses-7.jpg",
      "observatory-houses-8.jpg",
      "observatory-houses-9.jpg",
      "observatory-houses-10.jpg"
    ],
    "description": "Architecture is all about geometry and light. The light is about perceiving the form and the darkness is because of the absence of light.\nThus, the new intervention itself is a clear strong gesture that complements and amplifies the impressive landscape. The new white stripe is set apart from the fortress, so it is evident that they are from different periods of time. The stripe that meanders and adapts to the ground becomes dramatic as the terrain itself. It imitates the way of building of the old fortress. Each wall follows the natural shape of the rock, forming different platforms with a beautiful view.\nThe linear gesture starts at the edge of the old town and ends with a tower that interprets the old tower which collapsed in 1940. An inner street connects the programs with the entrance of the building. At some points, the street opens to the outside and leads to the external extensions such as observatory swimming pool, observatory amphitheater, and various platforms for observing the landscape or camping.\nCuriosity for exploring and the feeling of mystery are awakened with the play of light and shadows. The promenade culminates in a tower which contains a water collector with an observation telescope at the top. The collector is connected to the fortress with a folding bridge.\nThe houses are places of solitude and daydreaming, representing observatories in their own way. They are archaic shelters with carefully selected openings so that visitors can peek into the landscape or observe the starry sky. Their program is minimal in order to focus on their main goal, the chance to watch the sky in an extremely intimate atmosphere."
  },
  {
    "id": "project-14",
    "name": "Apartment MG",
    "category": ["interior design"],
    "location": "Skopje, North Macedonia",
    "year": 2020,
    "status": "realized",
    "surface": 60,
    "titleImage": "apartment-mg-0.jpg",
    "images": [
      "apartment-mg-1.jpg",
      "apartment-mg-2.jpg",
      "apartment-mg-3.jpg",
      "apartment-mg-4.jpg",
      "apartment-mg-5.jpg",
      "apartment-mg-6.jpg",
      "apartment-mg-7.jpg",
      "apartment-mg-8.jpg",
      "apartment-mg-9.jpg",
      "apartment-mg-10.jpg",
      "apartment-mg-11.jpg",
      "apartment-mg-13.jpg",
      "apartment-mg-14.jpg",
      "apartment-mg-15.jpg",
      "apartment-mg-16.jpg",
      "apartment-mg-17.jpg",
      "apartment-mg-18.jpg",
      "apartment-mg-19.jpg",
      "apartment-mg-20.jpg",
      "apartment-mg-21.jpg"
    ],
    "description": ""
  }
]
